IRP/src/Catalogs/LegalNameContracts/LegalNameContracts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>LegalNameContracts</name>
 <attributes>
  <name>BeginDate</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>EndDate</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>PartnerBankAccount</name>
  <type>
   <types>CatalogRef.PartnersBankAccounts</types>
  </type>
 </attributes>
 <attributes>
  <name>ContractNumber</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </attributes>
 <attributes>
  <name>LegalName</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/Companies/Companies.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>Companies</name>
 <predefined>
  <items>
   <name>Default</name>
  </items>
 </predefined>
 <attributes>
  <name>Country</name>
  <type>
   <types>CatalogRef.Countries</types>
  </type>
 </attributes>
 <attributes>
  <name>MainCompany</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>Type</name>
  <type>
   <types>EnumRef.CompanyLegalType</types>
  </type>
 </attributes>
 <attributes>
  <name>OurCompany</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>LandedCostCurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </attributes>
 <attributes>
  <name>LandedCostExpenseType</name>
  <type>
   <types>CatalogRef.ExpenseAndRevenueTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>LandedCostFillEmptyAmount</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>LandedCostPriceTypeForEmptyAmount</name>
  <type>
   <types>CatalogRef.PriceTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentStore</name>
  <type>
   <types>CatalogRef.Stores</types>
  </type>
 </attributes>
 <attributes>
  <name>TaxID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>20</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>MainPhoneNumber</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>SalaryAccrualVacation</name>
  <type>
   <types>CatalogRef.AccrualAndDeductionTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>SalaryMaxDaysVacation</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>3</precision>
   </numberQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>SalaryAccrualSickLeave</name>
  <type>
   <types>CatalogRef.AccrualAndDeductionTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>SalaryMaxDaysSickLeave</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>3</precision>
   </numberQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>SalaryBasicPayroll</name>
  <type>
   <types>CatalogRef.AccrualAndDeductionTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>PrintInfo</name>
  <type>
   <types>CatalogRef.PrintInfo</types>
  </type>
 </attributes>
 <attributes>
  <name>MainLegalAddress</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>1024</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>LegalCurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </attributes>
 <attributes>
  <name>BillingEmail</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>CurrencyRevaluationItem</name>
  <type>
   <types>CatalogRef.Items</types>
  </type>
 </attributes>
 <attributes>
  <name>CurrencyRevaluationItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </attributes>
 <attributes>
  <name>BatchID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>20</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>EntityID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>20</length>
   </stringQualifiers>
  </type>
 </attributes>
 <tabularSections>
  <name>Currencies</name>
  <attributes>
   <name>MovementType</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/LegalNameContracts/ManagerModule.bsl
Procedure ChoiceDataGetProcessing(ChoiceData, Parameters, StandardProcessing)
	If TypeOf(Parameters) <> Type("Structure") Or Not ValueIsFilled(Parameters.SearchString)
		Or Not Parameters.Filter.Property("Company") Then
		Return;
	EndIf;

	StandardProcessing = False;
	CommonFormActionsServer.CutLastSymbolsIfCameFromExcel(Parameters);
	CatalogsServer.SetParametersForDataChoosing(Catalogs.LegalNameContracts, Parameters);
	QueryTable = GetChoiceDataTable(Parameters);
	ChoiceData = CommonFormActionsServer.QueryTableToChoiceData(QueryTable);
EndProcedure

Function GetChoiceDataTable(Parameters)
	Filter = "";
	For Each FilterItem In Parameters.Filter Do
		If FilterItem.Key = "CustomSearchFilter" OR FilterItem.Key = "AdditionalParameters" Then
			Continue; // Service properties
		EndIf;
		If FilterItem.Key = "Company" Then
			Filter = Filter
				+ "
			|	AND Table." + FilterItem.Key + " IN (&" + FilterItem.Key + ", Value(Catalog.Companies.EmptyRef))";			
		Else
			Filter = Filter
				+ "
			|	AND Table." + FilterItem.Key + " = &" + FilterItem.Key;
		EndIf;
	EndDo;			 
	Settings = New Structure();
	Settings.Insert("MetadataObject", Metadata.Catalogs.LegalNameContracts);
	Settings.Insert("Filter", Filter);
	// enable search by code
	Settings.Insert("UseSearchByCode", True);
	
	QueryBuilderText = CommonFormActionsServer.QuerySearchInputByString(Settings);
	QueryBuilder = New QueryBuilder(QueryBuilderText);
	QueryBuilder.FillSettings();
	CommonFormActionsServer.SetCustomSearchFilter(QueryBuilder, Parameters);
	
	Query = QueryBuilder.GetQuery();

	Query.SetParameter("SearchString", Parameters.SearchString);
	For Each Filter In Parameters.Filter Do
		Query.SetParameter(Filter.Key, Filter.Value);
	EndDo;
	
	// parameters search by code
	SearchStringNumber = CommonFunctionsClientServer.GetSearchStringNumber(Parameters.SearchString);
	Query.SetParameter("SearchStringNumber", SearchStringNumber);

	Return Query.Execute().Unload();	
EndFunction
